"""
Модуль для реалізації алгоритму сортування вставками (Insertion Sort).
Алгоритм працює шляхом поступового впорядкування масиву, вставляючи кожен елемент
на правильне місце в уже відсортованій частині масиву.
"""

from typing import List

def insertion_sort(arr: List[int]) -> List[int]:
    """
    Сортує масив за допомогою алгоритму сортування вставками.

    Аргументи:
    - arr (List[int]): Масив для сортування.

    Повертає:
    - List[int]: Відсортований масив.
    """
    # Ітеруємо через масив, починаючи з другого елемента
    for i in range(1, len(arr)):
        key = arr[i]
        j = i - 1
        # Переміщуємо елементи, що більші за key, на одну позицію вправо
        while j >= 0 and key < arr[j]:
            arr[j + 1] = arr[j]
            j -= 1
        # Вставляємо key на правильну позицію
        arr[j + 1] = key

    return arr
